// 1.	Задача с интервью*

// У вас есть массив со скобками 
// Количество элементов и последовательность может быть разной.
// Нужно выяснить, у каждой ли скобки есть соответствующая пара (открывающая и закрывающая).
// Решение должно работать для всех массивов внизу.

// Первая последовательность: [ ‘(‘, ‘)’, ‘(‘, ‘)’, ‘)’]
// Вторая последовательность:  ['(', ')', '(', ')', '{', '(', '}', ')', 2, 'a']
// Еще: ['(', ')', '(', '(', '(', ')', '}', '(', ')', ')']


// ====================================================================================================================================================
// Name: Alex












// ====================================================================================================================================================
// Name: 


