// 6.	Переделайте задачку с улиткой используя циклы
// Улитка ползёт вверх по стене высотой 5 метров. Каждый день она проползает вверх на 3 метра, 
// а каждую ночь съезжает вниз на 2 метра. За сколько дней она доползет до вершины стены.


// ====================================================================================================================================================
// Name: Alex












// ====================================================================================================================================================
// Name: 