
// 11.	Есть код. Какой будет результат этого кода и почему

// 	const numbers = [1, 2, 3, 4, 5];
// let sum = 0;

// for (let i = 0; i < numbers.length; i++) {
//    		if (i % 2 !== 0) {
//         		sum += numbers[i];

// ====================================================================================================================================================
// Name: Alex












// ====================================================================================================================================================
// Name: Maria

// //            index 0  1  2  3  4
// const numbers = [1, 2, 3, 4, 5];
// let sum = 0;

// for (let i = 0; i < numbers.length; i++) {
//   //если индекс элемента нечетный  1 и 3
//   if (i % 2 !== 0) {
//     // sum = sum + numbers[i];
//     sum += numbers[i]; // элементы с нечетными индексами складываются  2 + 4
//   }
// }
// console.log(sum); //6
