
// 11.	Есть код. Какой будет результат этого кода и почему

// 	const numbers = [1, 2, 3, 4, 5];
// let sum = 0;

// for (let i = 0; i < numbers.length; i++) {
//    		if (i % 2 !== 0) {
//         		sum += numbers[i];

// ====================================================================================================================================================
// Name: Alex




// // Name: Alina

// Дан массив из 5 элементов, обозначена переменная суммы, 
// рассматриваются индексы от 0 до 3, если индекс не четный, то он сплюсовывается с суммой  (0+2+4=6)







// ====================================================================================================================================================
// Name: 
