// 5.	Циклы. При помощи цикла for выведите чётные числа от 2 до 10

// ====================================================================================================================================================
// Name: Alex

let a = 2;

for(let i = 2; i <= 10; i++){
    if(i % 2 === 0){
console.log(i)
    }
}



// ====================================================================================================================================================
// Name: Maria
// При помощи цикла for выведите чётные числа от 2 до 10
for (let i = 2; i < 11; i++) {
    console.log(i);
  }
  console.log('Мария');
  console.log('Мария1');