// 6.	Переделайте задачку с улиткой используя циклы
// Улитка ползёт вверх по стене высотой 5 метров. Каждый день она проползает вверх на 3 метра, 
// а каждую ночь съезжает вниз на 2 метра. За сколько дней она доползет до вершины стены.


// ====================================================================================================================================================
// Name: Alex












// ====================================================================================================================================================
// Name:  Maria
let day = 3; // Улитка поднимается за день
let night = 2; // Улитка сползает за ночь
let point = 0; // Текущая высота
let height = 5; // Высота стены
let result = 0; // Количество дней

for (result = 1; point < height; result++) {
  point += day; // Улитка поднимается днём

  if (point >= height) {
    break; // Если достигла вершины, выходим из цикла
  }

  point -= night; // Улитка сползает ночью
}
console.log(result);
