
// 7.	Нарисуйте ромб (подсказка: вложенные циклы)

//   *
//  ***
// *****
//  ***
//   *

let rhombSize = 5;
// for  


// 8.	Нарисуйте прямоугольный треугольник

// *
// * * *
// * * * * *
// * * * * * * *
// * * * * * * * * *


// 9.	Нарисуйте треугольник с цифрами - лево

// 0 1 2 3 4 5 6 7 8 9
// 0 1 2 3 4 5 6 7 8
// 0 1 2 3 4 5 6 7
// 0 1 2 3 4 5 6
// 0 1 2 3 4 5
// 0 1 2 3 4
// 0 1 2 3
// 0 1 2
// 0 1
// 0



// 10.	Нарисуйте треугольник с цифрами - право

// 0 1 2 3 4 5 6 7 8 9
//   0 1 2 3 4 5 6 7 8
//     0 1 2 3 4 5 6 7
//       0 1 2 3 4 5 6
//         0 1 2 3 4 5
//           0 1 2 3 4
//             0 1 2 3
//               0 1 2
//                 0 1
//                   0


// ====================================================================================================================================================
// Name: Alex












// // ====================================================================================================================================================
// // Name: Slava

// // 7.	Нарисуйте ромб (подсказка: вложенные циклы)
// let rhomb = '';
// let height = 5;
// let middle = Math.floor(height /2);

// for (let i = 0; i <= middle; i++) {
//   let line ='';

//   for (let j = 0; j < middle - i; j++) {
//     line += ' ';
//   }

//   for (let j = 0; j < 2 * i + 1; j++) {
//     line += '*';
//   }

//   rhomb += line + '\n';
// }

// for (let i = middle - 1; i >= 0; i--) {
//   let line = '';

//   for (let j = 0; j < middle - i; j++) {
//     line += ' ';
//   }

//   for (let j = 0; j < 2 * i + 1; j++) {
//     line += '*';
//   }

//   rhomb += line + '\n';
// }

// console.log(rhomb);



// // 8.	Нарисуйте прямоугольный треугольник
// let triangle = '';

// for (let i = 1; i <= 5; i++) {
//   line = '*'
//   for (let j = 2; j < 2 * i + 1; j++) {
//     triangle += line + ' ';
//   }
//   triangle += '\n';
// }
// console.log(triangle);

// // 9.	Нарисуйте треугольник с цифрами - лево
// let triangle = '';

// for (let i = 0; i < 10; i++) {
//   let line = '';
//   for (let j = 0; j < 10 - i; j++) {
//     line += j + ' ';
//   }

//   triangle += line.trim() + '\n';
// }
// console.log(triangle);

// // 10.	Нарисуйте треугольник с цифрами - право
// let triangle = '';
// let space = '';

// for (let i = 0; i < 10; i++) {
//   let line = '';
//   for (let j = 0; j < 10 - i; j++) {
//     line += j + ' ';
//   }

//   triangle += space + line.trim() + '\n';

//   space += '  ';

// }

// console.log(triangle);



// // ====================================================================================================================================================
// // Name: 
