
// Материал к прочтению:

// Циклы
// https://www.w3schools.com/js/js_loop_while.asp  
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Statements/while  
// https://learn.javascript.ru/while-for  (секция о цикле “while” и “do…while”)


// Задачки: ==================================================================================================================

// 1.	Нарисуйте треугольник с цифрами - вниз

// 9 8 7 6 5 4 3 2 1 0 1 2 3 4 5 6 7 8 9
//   8 7 6 5 4 3 2 1 0 1 2 3 4 5 6 7 8
//     7 6 5 4 3 2 1 0 1 2 3 4 5 6 7
//       6 5 4 3 2 1 0 1 2 3 4 5 6
//         5 4 3 2 1 0 1 2 3 4 5
//           4 3 2 1 0 1 2 3 4
//             3 2 1 0 1 2 3
//               2 1 0 1 2
//                 1 0 1
//                   0


// for (let i = 9; i > 0; i--) {
//     let str = ''
//     for (let j = 9; j > 0; j--) {
//         if (j > i) {
//             str += "  "
//         } else {
//             str += j + " "
//         }
//     }
//     console.log(str)
// }
// // Правая часть
// for (let i = 0; i <= 10; i++) {
//     let str1 = ''
//     for (let j = 0; j <= 9 - i; j++) {
//         str1 += j + " "

//     }
//     console.log(str1)
// }

// let str = "";

// for (let i = 9; i >= 0; i--) {
//   for (let j = 9; j > 0; j--) {
//     if (j > i) {
//       str += "  ";
//     } else {
//       str += j + " ";
//     }
//   }
//   for (let k = 0; k <= i; k++) {
//     str += k + " ";
//   }
//   str += "\n";
// }

// console.log(str);








// =============================================================================================================================

// 2.	Нарисуйте ромб из цифр (будьте внимательны!)
//          1
//         121
//        12321
//       1234321
//      123454321
//     12345654321
//    1234567654321
//   123456787654321
//  12345678987654321
// 1234567890987654321
//  12345678987654321
//   123456787654321
//    1234567654321
//     12345654321
//      123454321
//       1234321
//        12321
//         121
//          1
// let str = "";

// for (let i = 1; i <= 10; i++) {
//   for (let j = 10 - i; j > 0; j--) {
//     str += " ";
//   }
//   for (let k = 1; k <= i; k++) {
//     if (k == 10) {
//       str += 0;
//     } else {
//       str += k;
//     }
//   }
//   for (let l = i - 1; l > 0; l--) {
//     str += l;
//   }
//   str += "\n";
// }

// let str2 = "";




// for (let i = 1; i < 10; i++) {
//   for (let v = 0; v < i; v++) {
//     str2 += " ";
//   }
//   for (let m = 1; m <= 10 - i ; m++) {
//     str2 += m;
//   }
//   for (let j = 9 - i; j > 0; j--) {
// 	 str2 += j;
//   }
//   str2 += "\n";
// }

// let diamond = str + str2;

// console.log(diamond);

// ==========================================================================================================================

// 3.	Сложнее*: Нарисуйте горизонтальный треугольник из цифр

// 1  
// 2 3
// 4 5 6
// 7 8 9 10
// 11 12 13 14 15


// let str = "";
// let count = 0;

// for (let i = 1; i <= 5; i++) {
//   for (let j = 1; j <= i; j++) {
// 	 count++;
//     str += count + " ";
//   }
//   str += "\n";
// }
// console.log(str);

// ==========================================================================================================================
// 4.	Сложно, на смекалку: Нарисуйте вертикальный треугольник из цифр

// 1
// 2 6
// 3 7 10
// 4 8 11 13
// 5 9 12 14 15

// let str = "";
// let count = 0;
// let height = 10;
// for (let i = 1; i <= height; i++) {
//     count = i ;
//   for (let j = 1; j <= i; j++) {
//       str += count + " ";
//       count += height - j ;  
//   }

//   str += "\n";
// }
// console.log(str);


// ==========================================================================================================================

// 5.	Креативное задание 1*

// Имеется зашифрованное предложение 

// “Ybrobrubr brabrrbrebr brtbrhbrebr brbbrebrsbrtbr brQbrAbr brebrvbrebrrbr”

// Мы знаем, что оно означает “You are the best QA ever”.
// Нам нужно придумать программу дешифратор.



// let text = "Ybrobrubr brabrrbrebr brtbrhbrebr brbbrebrsbrtbr brQbrAbr brebrvbrebrrbr";
// let a  = text.split("br");
// console.log(a.join(""))


// // ==========================================================================================================================
// // 6.	Креативное задание 2* (посложнее)

// // Придумайте свой собственный шифр, а также программу, которая будет шифровать и затем дешифровщик к нему


let text1 = "How are you doing my friend?";
let newText1 = "";
let count = 0;
for (let i = 0; i < text1.length; i++){
    if (count % 2 == 0){
        newText1 = newText1 + text1[i] + "##"
    }
    count += 2
}
console.log(newText1);
// // 2
let b  = newText1.split("##");
console.log(b.join(""))


// ==========================================================================================================================
// 7.	Какой результат работы кода и почему? Выберите один ответ.
	
// 	let myArray = ["apple", "banana", "orange"];
// for (let index in myArray) {
//     console.log(myArray[index]);
// }

// 	Варианты ответов:
// a.	Цикл будет выполняться, но пропустит элементы массива.
// b.	Цикл завершится с ошибкой, так как "for...in" не предназначен для работы с массивами.
// c.	Цикл выполнится успешно, перебирая все элементы массива.
// d.	Цикл выполнится успешно, но пропустит первый элемент массива.


// answer:

// c.	Цикл выполнится успешно, перебирая все элементы массива.